// 5. 分析以下需求并实现
//    1.定义一个用于存放班级分数的数组var score = [80,90,85,90,78,88,89,93,98,75];
//    2.求出班级不及格人数(分数低于60分的就是不及格) ?? 
//    3.求出班级的平均分
//    4.求出班级的总分数
// 步骤
// 1.声明一个数组
var score = [80,90,85,90,78,88,89,93,98,75];
// 2. 声明一个变量  保存不及格人数
var num=0;
// 3. 声明一个变量  保存平均分
var avg=0;
// 4. 声明一个变量  保存总分数
var sum=0;
// 5. 用循环遍历数组
for (var  i = 0; i < score.length; i++) {
    // 6. 判断数组中的每个值是否小于60
    if(score[i]<60){
        // 6.1 如果小于60 num就+1
        num+=1;
    } 
    // 7.累加
    sum+=score[i];
}
// 8平均分
avg=sum/score.length;
// 9. 打印
console.log('班级不及格人数为'+num);
console.log('班级的平均分为'+avg);
console.log('班级的总分数为'+sum);