// 解答题
// 1.	什么时候会出现 undefined？
//声明一个变量但没有赋值时,就会出现undefined.

// 2.	什么是数组？什么时候使用？如何创建数组？
// 数组就是把一类数据组成一组
// 当需要输入多个数据时使用
// 创建数组有两种方法
// 方法一
// var arr =[1,2,3,4];
// 方法二
// var arr= new Array(1,2,3,4)

// 3.	如何获取和修改数组中的某一个值？
// 获取数组中的某一个值
// console.log(数组名[下标]);
// 修改数组中的某一个值
// 数组名[下标]=要修改的值

// 4.	什么是对象？什么时候使用？如何创建对象？
//  对象就是由多个键值对组合到一起形成的一种类型。
//  当一个变量有多个属性是就要使用对象
//  创建对象有两种方法
// 方法一
//  var obj={
//     属性名:属性值,
//     属性名:属性值,
//     属性名:属性值
// }

// 方法二
// var obj = new Object({
//         属性名:属性值,
//         属性名:属性值,
//         属性名:属性值
// });

// 5.	如何读取和修改和删除对象中的值？
// 读取对象中的值
// console.log( obj.属性名 )
// 修改对象中的值
// obj.属性名=要修改的值
// 删除对象中的值
// delete obj.属性名

// 6.	什么是数据类型？干什么用的？有几种数据类型？
// 数据类型就是储存数据的几种方法
//用来储存数据的
// 有七种数据类型
// 1.number
// 2.string
// 3.boolean
// 4.undefined
// 5. null
// 6.object
// 7.symbol

// 7.	Boolean 类型有几个值？分别代表什么？
// Boolean只有两种值  true  false
// true代表对
// false代表错

// 8.	什么时候使用字符串类型？
// 加引号是就使用字符串类型
// 9.	为变量起名有什么要求？
// 变量名只能有数字,字母和下划线,变量名不能以数字开头
// 10.	如何定义常量？常量命名规范?
// const 常量名=值;
// 常量名只能有数字,字母和下划线,常量名不能以数字开头常量名要大写

// 11.	如何定义多行字符串？有几种方法？
// 有两种方法
// 第一种方法
// 在每一行后面加上\
// 第二种方法
// 用``把字符串抱起来
